codebydant/nrF52-cmake-examples/examples/ble_app_randomic_number/src/main.c
  err_code = ble_random_number_service_init(&m_random_number_service, &random_number_init);
  // NRF_LOG_INFO("Done with services_init()\r\n");
  APP_ERROR_CHECK(err_code);

  /* YOUR_JOB: Add code to initialize the services used by the application.
     ble_xxs_init_t                     xxs_init;
     ble_yys_init_t                     yys_init;

     // Initialize XXX Service.
     memset(&xxs_init, 0, sizeof(xxs_init));

     xxs_init.evt_handler                = NULL;
     xxs_init.is_xxx_notify_supported    = true;
     xxs_init.ble_xx_initial_value.level = 100;

     err_code = ble_bas_init(&m_xxs, &xxs_init);
     APP_ERROR_CHECK(err_code);

     // Initialize YYY Service.
     memset(&yys_init, 0, sizeof(yys_init));
     yys_init.evt_handler                  = on_yys_evt;
     yys_init.ble_yy_initial_value.counter = 0;

     err_code = ble_yy_service_init(&yys_init, &yy_init);
     APP_ERROR_CHECK(err_code);
   */
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt) {
  ret_code_t err_code;

  if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    APP_ERROR_CHECK(err_code);
  }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error) { APP_ERROR_HANDLER(nrf_error); }

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void) {
  ret_code_t err_code;
  ble_conn_params_init_t cp_init;

  memset(&cp_init, 0, sizeof(cp_init));

  cp_init.p_conn_params = NULL;
  cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
  cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
  cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
  cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail = false;
  cp_init.evt_handler = on_conn_params_evt;
  cp_init.error_handler = conn_params_error_handler;

  err_code = ble_conn_params_init(&cp_init);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting timers.
 */
// static void application_timers_start(void) {
//    YOUR_JOB: Start your timers. below is an example of how to start a timer.
//      ret_code_t err_code;
//      err_code = app_timer_start(m_app_timer_id, TIMER_INTERVAL, NULL);
//      APP_ERROR_CHECK(err_code);
// }

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void) {
  ret_code_t err_code;

  err_code = bsp_indication_set(BSP_INDICATE_IDLE);
  APP_ERROR_CHECK(err_code);

  // Prepare wakeup buttons.
  err_code = bsp_btn_ble_sleep_mode_prepare();
  APP_ERROR_CHECK(err_code);

  // Go to system-off mode (this function will not return; wakeup will cause a reset).
  err_code = sd_power_system_off();
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt) {
  ret_code_t err_code;

  switch (ble_adv_evt) {
  case BLE_ADV_EVT_FAST:
    // NRF_LOG_INFO("Fast advertising.");
    err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    APP_ERROR_CHECK(err_code);
    break;

  case BLE_ADV_EVT_IDLE:
    sleep_mode_enter();
    break;

  default:
    break;
  }
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context) {
  ret_code_t err_code = NRF_SUCCESS;

  switch (p_ble_evt->header.evt_id) {
  case BLE_GAP_EVT_DISCONNECTED:
    NRF_LOG_INFO("Disconnected.\n");
    NRF_LOG_INFO("-------------------------------");
    // LED indication will be changed when advertising starts.
    break;

  case BLE_GAP_EVT_KEY_PRESSED:
    NRF_LOG_INFO("read button pressed\n");
    break;

  case BLE_GAP_EVT_CONNECTED:
    NRF_LOG_INFO("Connected.");
    err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
    APP_ERROR_CHECK(err_code);
    m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
    err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
    APP_ERROR_CHECK(err_code);
    break;

  case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
    NRF_LOG_INFO("PHY update request.");
    ble_gap_phys_t const phys = {
        .rx_phys = BLE_GAP_PHY_AUTO, .tx_phys = BLE_GAP_PHY_AUTO,
    };
    err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
    APP_ERROR_CHECK(err_code);
  } break;

  case BLE_GATTC_EVT_TIMEOUT:
    // Disconnect on GATT Client timeout event.
    NRF_LOG_INFO("GATT Client Timeout.");
    err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    APP_ERROR_CHECK(err_code);
    break;

  case BLE_GATTS_EVT_TIMEOUT:
    // Disconnect on GATT Server timeout event.
    NRF_LOG_INFO("GATT Server Timeout.");
    err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    APP_ERROR_CHECK(err_code);
    break;

  case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
    NRF_LOG_INFO("read button pressed");
    ble_gatts_rw_authorize_reply_params_t auth_read;
    auth_read.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
    auth_read.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
    const uint8_t new_val = rand();
    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &auth_read);
    APP_ERROR_CHECK(err_code);
    ble_random_number_data_io_value_update(&m_random_number_service, new_val);
    break;

  default:
    // No implementation needed.
    break;
  }
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void) {
  ret_code_t err_code;

  err_code = nrf_sdh_enable_request();
  APP_ERROR_CHECK(err_code);

  // Configure the BLE stack using the default settings.
  // Fetch the start address of the application RAM.
  uint32_t ram_start = 0;
  err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
  APP_ERROR_CHECK(err_code);

  // Enable BLE stack.
  err_code = nrf_sdh_ble_enable(&ram_start);
  APP_ERROR_CHECK(err_code);

  // Register a handler for BLE events.
  NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

/**@brief Function for the Peer Manager initialization.
 */
// static void peer_manager_init(void) {
//   ble_gap_sec_params_t sec_param;
//   ret_code_t err_code;

//   err_code = pm_init();
//   APP_ERROR_CHECK(err_code);

//   memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

//   // Security parameters to be used for all security procedures.
//   sec_param.bond = SEC_PARAM_BOND;
//   sec_param.mitm = SEC_PARAM_MITM;
//   sec_param.lesc = SEC_PARAM_LESC;
//   sec_param.keypress = SEC_PARAM_KEYPRESS;
//   sec_param.io_caps = SEC_PARAM_IO_CAPABILITIES;
//   sec_param.oob = SEC_PARAM_OOB;
//   sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
//   sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
//   sec_param.kdist_own.enc = 1;
//   sec_param.kdist_own.id = 1;
//   sec_param.kdist_peer.enc = 1;
//   sec_param.kdist_peer.id = 1;

//   err_code = pm_sec_params_set(&sec_param);
//   APP_ERROR_CHECK(err_code);

