codebydant/nrF52-cmake-examples/examples/ble_app_randomic_number/src/main.c
//   err_code = pm_register(pm_evt_handler);
//   APP_ERROR_CHECK(err_code);
// }

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void) {
  ret_code_t err_code;

  NRF_LOG_INFO("Erase bonds!");

  err_code = pm_peers_delete();
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */
static void bsp_event_handler(bsp_event_t event) {
  ret_code_t err_code;

  switch (event) {
  case BSP_EVENT_SLEEP:
    sleep_mode_enter();
    break; // BSP_EVENT_SLEEP

  case BSP_EVENT_DISCONNECT:
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_ERROR_INVALID_STATE) {
      APP_ERROR_CHECK(err_code);
    }
    break; // BSP_EVENT_DISCONNECT

  case BSP_EVENT_WHITELIST_OFF:
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
      err_code = ble_advertising_restart_without_whitelist(&m_advertising);
      if (err_code != NRF_ERROR_INVALID_STATE) {
        APP_ERROR_CHECK(err_code);
      }
    }
    break; // BSP_EVENT_KEY_0

  default:
    break;
  }
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void) {
  ret_code_t err_code;
  ble_advertising_init_t init;

  memset(&init, 0, sizeof(init));

  init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
  init.advdata.include_appearance = true;
  init.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
  init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  init.advdata.uuids_complete.p_uuids = m_adv_uuids;

  init.config.ble_adv_fast_enabled = true;
  init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
  init.config.ble_adv_fast_timeout = APP_ADV_DURATION;

  init.evt_handler = on_adv_evt;

  err_code = ble_advertising_init(&m_advertising, &init);
  APP_ERROR_CHECK(err_code);

  ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool *p_erase_bonds) {
  ret_code_t err_code;
  bsp_event_t startup_event;

  err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
  APP_ERROR_CHECK(err_code);

  err_code = bsp_btn_ble_init(NULL, &startup_event);
  APP_ERROR_CHECK(err_code);

  *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void) {
  ret_code_t err_code = NRF_LOG_INIT(NULL);
  APP_ERROR_CHECK(err_code);

  NRF_LOG_DEFAULT_BACKENDS_INIT();
  NRF_LOG_PROCESS();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
  ret_code_t err_code;
  err_code = nrf_pwr_mgmt_init();
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void) {
  if (NRF_LOG_PROCESS() == false) {
    nrf_pwr_mgmt_run();
  }
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds) {
  if (erase_bonds == true) {
    delete_bonds();
    // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
  } else {
    ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

    APP_ERROR_CHECK(err_code);
  }
}

/**@brief Function for application main entry.
 */
int main(void) {
  bool erase_bonds;

  log_init();
  printf("\n");
  NRF_LOG_INFO("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
  NRF_LOG_INFO("***      MAIN PROGRAM     ***");
  NRF_LOG_INFO("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");

  NRF_LOG_INFO("-------------------------------");
  NRF_LOG_INFO("---	Setting timers: ENABLED");
  timers_init();

  NRF_LOG_INFO("---	Setting leds: ENABLED");
  buttons_leds_init(&erase_bonds);

  NRF_LOG_INFO("---	Setting power management: ENABLED");
  power_management_init();

  NRF_LOG_INFO("---	Setting BLE interrupt: ENABLED");
  ble_stack_init();

  NRF_LOG_INFO("---	Setting BLE device: %s", DEVICE_NAME);
  gap_params_init();

  NRF_LOG_INFO("---	Setting GATT module: ENABLED");
  gatt_init();

  NRF_LOG_INFO("---	Setting services: ENABLED");
  services_init();

  NRF_LOG_INFO("---	Setting advertising: ENABLED");
  advertising_init();

  NRF_LOG_INFO("---	Setting connection parameters");
  conn_params_init();

  // peer_manager_init();

  // Start execution.
  // NRF_LOG_INFO("RANDOM NUMBER started10.");
  // application_timers_start();

  NRF_LOG_INFO("---	Advertising started\n");
  advertising_start(erase_bonds);

  NRF_LOG_INFO("-------------------------------");
  NRF_LOG_INFO("---	Waiting BLE connection");

  for (;;) {
    // NRF_LOG_INFO("RANDOMIC...");
    // ble_random_number_data_io_value_update(&m_random_number_service, new_val);
    nrf_delay_ms(300);
    idle_state_handle();
  }
}

/**
 * @}
 */
